node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 28
          }
          dim {
            size: 28
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 28
        }
        dim {
          size: 28
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 32
      }
    }
  }
}
node {
  name: "drop_remainder"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "Iterator"
  op: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 28
          }
          dim {
            size: 28
          }
          dim {
            size: 1
          }
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "Placeholder"
  input: "Placeholder_1"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 28
          }
          dim {
            size: 28
          }
          dim {
            size: 1
          }
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "MapDataset"
  op: "MapDataset"
  input: "TensorSliceDataset"
  attr {
    key: "Targuments"
    value {
      list {
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "tf_data_structured_function_wrapper_k1jrBRIWHVU"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 28
          }
          dim {
            size: 28
          }
          dim {
            size: 1
          }
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
}
node {
  name: "BatchDatasetV2"
  op: "BatchDatasetV2"
  input: "MapDataset"
  input: "batch_size"
  input: "drop_remainder"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 28
          }
          dim {
            size: 28
          }
          dim {
            size: 1
          }
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
}
node {
  name: "MakeIterator"
  op: "MakeIterator"
  input: "BatchDatasetV2"
  input: "Iterator"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "harmonics_or_legendre/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 8
          }
          dim {
            size: 8
          }
          dim {
            size: 28
          }
          dim {
            size: 28
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_COMPLEX128
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_COMPLEX128
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 8
          }
          dim {
            size: 8
          }
          dim {
            size: 28
          }
          dim {
            size: 28
          }
        }
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
        dcomplex_val: 0.28209479177387814
        dcomplex_val: 0.0
